{
  "statements": [
    {
      "slug": "statement",
      "headline": "Artist Statement",
      "post": [
        {
          "type": "text",
          "value": "Domestic items are an emotional exploration of what is left behind."
        },
        {
          "type": "text",
          "value": "With my work I concentrate on the representation of the tangible, here"
        },
        {
          "type": "text",
          "value": "and now, that can trigger a feeling or a memory."
        },
        {
          "type": "text",
          "value": "Works like “Mi Mesa” place me in at a happy family dinner, “My Kitchen”"
        },
        {
          "type": "text",
          "value": "depicts the utensils we use when cooking together in any family"
        },
        {
          "type": "text",
          "value": "gathering. The editions of “mi mate” bring me closer to my friends and my"
        },
        {
          "type": "text",
          "value": "Heritage."
        },
        {
          "type": "text",
          "value": "I work in printmaking. Producing multiples makes me think I am generating connections. People drawn by the same picture"
        },
        {
          "type": "text",
          "value": "but engaging with it in different ways. A connection they don’t know"
        },
        {
          "type": "text",
          "value": "Exists."
        },
        {
          "type": "text",
          "value": "My preferred technique is relief. Carving on wood or linoleum is almost"
        },
        {
          "type": "text",
          "value": "meditative, I can feel what I am doing. With each piece of wood removed I"
        },
        {
          "type": "text",
          "value": "uncover more of me. When rolling the ink on a plate I see the full image"
        },
        {
          "type": "text",
          "value": "becoming a reality. Then I pass it through the press and slowly and,"
        },
        {
          "type": "text",
          "value": "somewhat anxiously, I peel up the paper to unveil my final work. Even"
        },
        {
          "type": "text",
          "value": "though these are repetitive movements I feel the excitement, surprise and"
        },
        {
          "type": "text",
          "value": "relief with every print."
        },
        {
          "type": "text",
          "value": "I am currently experimenting with collage, adding texture to my pieces"
        },
        {
          "type": "text",
          "value": "through Chine collé, knitted items, fabric and stitches."
        },
        {
          "type": "text",
          "value": "Mostly I bring portions of my previous printings into a new composition. I"
        },
        {
          "type": "text",
          "value": "feel I am creating a collection of memories, or perhaps a glimpse into the"
        },
        {
          "type": "text",
          "value": "future."
        }
      ]
    },
    {
      "slug": "biography",
      "headline": "Artist Biography",
      "post": [
        {
          "type": "text",
          "value": "Dolores Martinez is an architect turned artist. She completed her architectural"
        },
        {
          "type": "text",
          "value": "education in Argentina. She lived and worked in Argentina, Japan and various cities"
        },
        {
          "type": "text",
          "value": "in the United States before settling in Houston. This collection of experiences"
        },
        {
          "type": "text",
          "value": "enriched her life and developed a sensitivity for human connections. After"
        },
        {
          "type": "text",
          "value": "experiencing flooding during Hurricane Harvey she has put her energy in rebuilding"
        },
        {
          "type": "text",
          "value": "not only her home but also her personal journey. She merged her design"
        },
        {
          "type": "text",
          "value": "background and lived experiences into her artistic identity. She started her training at"
        },
        {
          "type": "text",
          "value": "the Glassell School of Art at the MFAH in 2021. She has been active in printmaking"
        },
        {
          "type": "text",
          "value": "since."
        }
      ]
    }
  ]
}
